In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# pandas 데이터 구조
* series 1차원 배열구조
* dataframe 2차원 자료구조

# Series

In [4]:
s = pd.Series([3,-5,7,4]) # 인덱스 없이 생성
print(s)
print(type(s))

0    3
1   -5
2    7
3    4
dtype: int64
<class 'pandas.core.series.Series'>

* 인덱스를 특별히 지정하지 않으면, numpy 다차원배열처럼 0부터 인덱스가 시작
* numpy 다차원 배열과 다르게 series는 인덱스 지정이 가능하고, 숫자나 문자가 가능하다

In [7]:
s = pd.Series([3,-5,7,4], index=['a','b','c','d'])
s

a    3
b   -5
c    7
d    4
dtype: int64

# 속성

In [8]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
s.values

array([ 3, -5,  7,  4])

# 인덱싱
* '조회' 개념과 비슷

In [10]:
# index명으로 조회
s['a']

3

In [11]:
# index 순서로 조회
s[0]

3

In [12]:
s * 100

a    300
b   -500
c    700
d    400
dtype: int64

# 인덱스가 문자열로 저장된 숫자일 경우
* 정수형 으로 인덱스 지정을 권장
* 1이 아닌 0부터 인덱스를 지정

In [13]:
sr = pd.Series([1,2,3,4], index=['1','2','3','4'])
sr

1    1
2    2
3    3
4    4
dtype: int64

In [14]:
# index명으로 접근
sr['1']

1

In [15]:
# index 순서로 접근
sr[1]

2

# Dataframe

In [17]:
# 중첩된 리스트
data = [['Belgium', 'Brussels', 11190846],
        ['India', 'New Delhi', 1303171035],
        ['Brazil', 'Brasília', 207847528]]
# df로 변환
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population']) # 컬럼명을 명시
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

* dataframe 데이터는 딕셔너리 타입으로 넘겨주는 것이 일반적이다.
* 동일한 데이터 타입끼리 함께 묶어서 넘겨줄 수 있기 때문

In [18]:
# 딕셔너리 타입
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [19]:
# 인덱스 변경 가능
df_2 = pd.DataFrame(data, index=['aa','bb','cc'])
df_2

    Country    Capital  Population
aa  Belgium   Brussels    11190846
bb    India  New Delhi  1303171035
cc   Brazil   Brasília   207847528

In [20]:
type(df)

pandas.core.frame.DataFrame

In [22]:
print(df['Country'])
print(type(df['Country']))

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object
<class 'pandas.core.series.Series'>

# 속성

In [23]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [25]:
df.dtypes

Country       object
Capital       object
Population     int64
dtype: object

In [26]:
df.values

array([['Belgium', 'Brussels', 11190846],
       ['India', 'New Delhi', 1303171035],
       ['Brazil', 'Brasília', 207847528]], dtype=object)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [52]:
# 특정 컬럼을 index로 사용할 수 있다.
df_index_with_country = df.set_index('Country')
df_index_with_country

           Capital  Population
Country
Belgium   Brussels    11190846
India    New Delhi  1303171035
Brazil    Brasília   207847528

In [31]:
# 인덱스는 한개 이상도 가능하다.
# ['Country','Capital']
df_index_with_country = df.set_index(['Country','Capital'])
df_index_with_country

                   Population
Country Capital
Belgium Brussels     11190846
India   New Delhi  1303171035
Brazil  Brasília    207847528

In [35]:
# indexing
df_index_with_country.loc[['India','India']]

                   Population
Country Capital
India   New Delhi  1303171035
        New Delhi  1303171035

In [36]:
# series를 통해서도 dataframe을 생성할 수 있다.

s_1 = pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])
s_2 = pd.Series([5, 6, 7, 8], index=['A', 'B', 'C', 'D'])
s_3 = pd.Series([9, 10, 11, 12], index=['A', 'B', 'C', 'D'])

data = {'col1': s_1,
        'col2': s_2,
        'col3': s_3}

df_4 = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

df_4

   col1  col2  col3
A     1     5     9
B     2     6    10
C     3     7    11
D     4     8    12

# numpy ndarray와 비교

## 공통점

In [37]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [39]:
s + 10 # series의 특징

a    13
b     5
c    17
d    14
dtype: int64

In [40]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [41]:
df['Population']

0      11190846
1    1303171035
2     207847528
Name: Population, dtype: int64

In [42]:
df['Population'] / 100

0      111908.46
1    13031710.35
2     2078475.28
Name: Population, dtype: float64

In [43]:
df['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [44]:
df['Capital']

0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object

In [46]:
df['Country'] + df['Capital'] # 각 요소간 결합이 발생

0    BelgiumBrussels
1     IndiaNew Delhi
2     BrazilBrasília
dtype: object

## 차이점

In [47]:
# series간 연산을 하는 경우 index를 기반으로 이루어짐
s

a    3
b   -5
c    7
d    4
dtype: int64

In [48]:
s1 = s[['a', 'b']]
s1

a    3
b   -5
dtype: int64

In [49]:
s2 = s[['b', 'c']]
s2

b   -5
c    7
dtype: int64

In [50]:
s1 + s2

a     NaN
b   -10.0
c     NaN
dtype: float64

In [53]:
# practice
# 각 국가의 수도의 인구는 벨기에 인구의 몇배일까?
df_index_with_country

           Capital  Population
Country
Belgium   Brussels    11190846
India    New Delhi  1303171035
Brazil    Brasília   207847528

In [56]:
df_index_with_country['Population'] / df_index_with_country['Population']['Belgium']

Country
Belgium      1.000000
India      116.449734
Brazil      18.572995
Name: Population, dtype: float64

# Pandas Importing/Exporting

In [57]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [61]:
json_data = df.to_json()
json_data

'{"Country":{"0":"Belgium","1":"India","2":"Brazil"},"Capital":{"0":"Brussels","1":"New Delhi","2":"Bras\\u00edlia"},"Population":{"0":11190846,"1":1303171035,"2":207847528}}'

In [62]:
pd.read_json(json_data)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [72]:
!pip install wget

Requirement already satisfied: wget in /Users/sky/.pyenv/versions/3.10.5/lib/python3.10/site-packages (3.2)

In [76]:
# csv, 하나의 파일로 관리 가능한 크기라면 일반적으로 csv 포맷을 활용
!wget -O 'iris_sample.csv' https://raw.githubusercontent.com/duc-ke/edu_jupyter_pandas/master/dataset/iris_sample.csv

--2022-12-03 15:31:37--  https://raw.githubusercontent.com/duc-ke/edu_jupyter_pandas/master/dataset/iris_sample.csv
raw.githubusercontent.com (raw.githubusercontent.com) 해석 중... 185.199.109.133, 185.199.111.133, 185.199.110.133, ...
다음으로 연결 중: raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... 연결했습니다.
HTTP 요청을 보냈습니다. 응답 기다리는 중... 200 OK
길이: 683 [text/plain]
저장 위치: `iris_sample.csv'

iris_sample.csv     100%[===================>]     683  --.-KB/s    /  0s

2022-12-03 15:31:37 (9.87 MB/s) - `iris_sample.csv' 저장함 [683/683]

In [81]:
iris = pd.read_csv('./iris_sample.csv')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [79]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  26 non-null     float64
 1   sepal_width   25 non-null     float64
 2   petal_length  23 non-null     float64
 3   petal_width   26 non-null     float64
 4   species       26 non-null     object
dtypes: float64(4), object(1)
memory usage: 1.1+ KB

In [88]:
iris2 = iris.head()
iris2.to_csv('df_iris_sample.csv', encoding='utf8', index=False)

In [89]:
i = pd.read_csv('./df_iris_sample.csv')
i

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [94]:
import sqlalchemy

user = "anonymous"
host = "ensembldb.ensembl.org"
port = 3337
database = "ailuropoda_melanoleuca_core_79_1"

url = f"mysql+mysqlconnector://{user}@{host}:{port}/{database}"
# url = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{database}"

connection = sqlalchemy.create_engine(url)

In [97]:
pd.read_sql('select created, logic_name, db  from analysis limit 5', connection)

              created     logic_name             db
0 2010-01-27 18:23:33        genscan  HumanIso.smat
1 2010-06-17 12:10:04  other_protein           None
2 2010-01-27 18:23:34        eponine        eponine
3 2010-06-17 12:10:04            trf           None
4 2010-06-17 12:10:04       trnascan           trna

# 인덱싱/슬라이싱

In [98]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [100]:
# 단일 컬럼조회
df['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [101]:
# 복수 컬럼 조회
df[['Country', 'Capital']]

   Country    Capital
0  Belgium   Brussels
1    India  New Delhi
2   Brazil   Brasília

In [103]:
# 슬라이싱, 2는 미포함
df[0:2]

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

In [106]:
 df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [108]:
df.iloc[0,0] # 위치를 통한 인덱싱

'Belgium'

In [109]:
df.iloc[1,0]

'India'

In [110]:
df.loc[0, 'Country'] # 라벨을 통한 인덱싱

'Belgium'

In [111]:
df.loc[0, 'Capital'] # 라벨을 통한 인덱싱

'Brussels'

In [112]:
df.iloc[0:1,0:2] # 위치를 통한 슬라이싱 (끝은 미포함)

   Country   Capital
0  Belgium  Brussels

In [114]:
df.loc[0:1, 'Country':'Capital']

   Country    Capital
0  Belgium   Brussels
1    India  New Delhi

In [116]:
# 불리언 인덱싱 (필터링)
df['Population'] > 200000000

0    False
1     True
2     True
Name: Population, dtype: bool

In [117]:
df[df['Population'] > 200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

# 삭제

In [120]:
# 행삭제
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [121]:
df.drop(1, axis=0)

   Country   Capital  Population
0  Belgium  Brussels    11190846
2   Brazil  Brasília   207847528

In [122]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [128]:
df.drop([0,1])

  Country   Capital  Population
2  Brazil  Brasília   207847528

In [129]:
# 열삭제 axis=1
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [130]:
df.drop(['Country', 'Capital'], axis=1)

   Population
0    11190846
1  1303171035
2   207847528

In [131]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [132]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [133]:
df.sort_values('Population') # 오름차순 정렬

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [134]:
df.sort_values('Population', ascending=False) # 내림차순 정렬

   Country    Capital  Population
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528
0  Belgium   Brussels    11190846

In [135]:
df.isnull() # null값 확인

   Country  Capital  Population
0    False    False       False
1    False    False       False
2    False    False       False

In [137]:
# 컬럼별로 null값이 있는지 확인
df.isnull().any(axis=0)

Country       False
Capital       False
Population    False
dtype: bool

In [139]:
# 행별로 null값 확인
df.isnull().any(axis=1)

0    False
1    False
2    False
dtype: bool

In [140]:
df2 = df.copy()
df2

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [141]:
df2.loc[0,'Population'] = None

In [142]:
df2.isnull().any()

Country       False
Capital       False
Population     True
dtype: bool

In [143]:
# aggregate function

df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [144]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [145]:
df.min()

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [146]:
df.max()

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [151]:
df['Population'].mean()

507403136.3333333

In [152]:
df['Population'].median()

207847528.0

In [149]:
!wget -O 'titles.csv' https://docs.google.com/spreadsheets/d/1fiioUPMRurfE523yWGaRF3ckO-TUHu1AaIAI6Eo7Ti8/export?format=csv

zsh:1: no matches found: https://docs.google.com/spreadsheets/d/1fiioUPMRurfE523yWGaRF3ckO-TUHu1AaIAI6Eo7Ti8/export?format=csv

In [159]:
# apply function
df.loc[:, 'Population':'Population']

   Population
0    11190846
1  1303171035
2   207847528

In [160]:
df.loc[:, 'Population':'Population'].apply(lambda x: x + 1)

   Population
0    11190847
1  1303171036
2   207847529

In [161]:
# 여러 개의 요소를 활용하는 경우
df.loc[:, 'Country':'Capital']

   Country    Capital
0  Belgium   Brussels
1    India  New Delhi
2   Brazil   Brasília

In [168]:
df.loc[:, 'Country':'Capital'].apply(lambda x: x['Country'] + 's capital is ' + x['Capital'], axis=1)

0    Belgiums capital is Brussels
1     Indias capital is New Delhi
2     Brazils capital is Brasília
dtype: object

In [170]:
df.loc[:, 'Country':'Capital'].apply(lambda x: x[0] + 's capital is ' + x[1], axis=1)

0    Belgiums capital is Brussels
1     Indias capital is New Delhi
2     Brazils capital is Brasília
dtype: object

In [171]:
# groupby
# dataframe을 key값에 따라 나눈 뒤 각각에 특정 함수를 적용한 뒤 다시 합치고 싶을 때
# group by는 split-apply-combine 3단계를 거침

In [172]:
df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                   'data': [0, 5, 10, 5, 10, 15, 10, 15, 20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [173]:
df['key'].unique()

array(['A', 'B', 'C'], dtype=object)

In [174]:
 df.groupby('key').sum()

     data
key
A      15
B      30
C      45